import pygame
import random

SX = 800
SY = 800

pygame.init()
screen = pygame.display.set_mode((SX, SY))
running = True

NumStar = 100  # Общее количество звезд
speed = 0.09  # Скорость полета звезд
stars = []  # Список, содержащий звезды


# каждая звезда состоит из X-координаты, Y-координаты,
# расстояния по Z (дальность до звезды), цвет

# -----------------------------------------------------------------------------------
# Функция генерации новой звезды.
# -----------------------------------------------------------------------------------
def new_star():
    star = [random.randint(0, SX) - SX // 2, random.randint(0, SY) - SY // 2, 256, 0]
    return star


# -----------------------------------------------------------------------------------
for i in range(0, NumStar):  # Заполняем список новыми сгенерированными звездами.
    stars.append(new_star())

while running:
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            running = False

    screen.fill((0, 0, 0))  # Очищаем экран
    x = y = 0
    for i in range(0, NumStar):  # Цикл по всем звездам.
        s = stars[i]  # Запоминаем характеристики звезды из списка
        # Вычисляем текущие координаты звезды
        x = s[0] * 256 / s[2]
        y = s[1] * 256 / s[2]
        s[2] -= speed  # Изменяем ее координату по Z

        # Если координаты вышли за пределы экрана - генерируем новую звезду.
        if s[2] <= 0 or x <= -SX // 2 or x >= SX // 2 or y <= -SY // 2 or y >= SY // 2:
            s = new_star()

        if s[3] < 256:  # Если цвет не достиг максимума яркости, увеличиваем цвет.
            s[3] += 0.15

        if s[3] >= 256:  # Если вдруг цвет стал больше допустимого, то выставляем его как 255
            s[3] = 255

        stars[i] = s  # Помещаем звезду обратно в список звезд.

        # Отображаем звезду на экране.
        x = round(s[0] * 256 / s[2]) + SX // 2
        y = round(s[1] * 256 / s[2]) + SY // 2
        pygame.draw.circle(screen, (s[3], s[3], s[3]), (x, y), 3)

    pygame.display.flip()

pygame.quit()